Revit 2027 API
ComboBox.GetItems Method
Gets the copy of a collection of the ComboBoxMembers assigned to the ComboBox.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ComboBoxMember> GetItems()
Public Function GetItems As IList(Of ComboBoxMember)
public:
IList<ComboBoxMember^>^ GetItems()
member GetItems : unit -> IList<ComboBoxMember>
Return Value
IList<ComboBoxMember>
See Also
Reference
ComboBox Class
Autodesk.Revit.UI Namespace